Data/SimulationFiles/E0_Re100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       346;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-2 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          50;
        startFace       396;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (2 0 0);
    }
    fixedWalls-bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4;
        startFace       446;
    }
    fixedWalls-top
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          4;
        startFace       450;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          400;
        startFace       454;
    }
)

// ************************************************************************* //
